Pipe Flow Validation/Linux Files/cases/kOmegaSST_Re50000/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         3000;
deltaT          1;

writeControl    timeStep;
writeInterval   3000;
purgeWrite      1;

writeFormat     ascii;
writePrecision  8;

runTimeModifiable true;

functions
{
    wallShearStress
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        patches         (wall);
        writeControl    writeTime;
        log             true;
    }

    patchAverage
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        log             true;
        writeFields     false;
        regionType      patch;
        name            wall;
        operation       areaAverage;
        fields          (wallShearStress);
    }
}
