Pipe Flow Validation/Linux Files/cases/kOmegaSST_Re50000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          25;
        startFace       2425;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          25;
        startFace       2450;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       2475;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1250;
        startFace       2525;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1250;
        startFace       3775;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          50;
        startFace       5025;
    }
)

// ************************************************************************* //
