Pipe Flow Validation/Linux Files/cases/kOmegaSST_Re50000/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

// omega = sqrt(k) / (C_mu^0.25 * l), l = 0.07*R = 0.00175 m. Placeholder.
internalField   uniform 958.3543;

boundaryField
{
    inlet   { type cyclic; }
    outlet  { type cyclic; }
    wall
    {
        type            omegaWallFunction;
        value           uniform 958.3543;
    }
    front   { type wedge; }
    back    { type wedge; }
    axis    { type empty; }
}
